Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །ཀླུ་ནི་བརྒྱ་སྟོང་མང་པོའི་ནང་། །རྫུ་འཕྲུལ་དང་ནི་གཟི་བྱིན་ལྡན། །མདོ་སྡེ་འཛིན་པ་སྲུང་བྱེད་པས། །ཉིན་མཚན་རྟག་པར་ཡོང་མི་འབྲལ། །བ་ལི་དང་ནི་སྒྲ་གཅན་དང་། །ཐགས་ཟངས་རིས་དང་སྡོམ་བ་པ། །བོང་བུ་དཔུང་དང་ཕྲག་ཆེན་དང་།
en: Anavatapta, the nāga king, The king of nāgas Sāgara, Elapatra and Mucilinda, And Nanda and Upananda, “ ‘These among a hundred thousand nāgas Possessing miraculous powers and majesty Give their protection to keepers of the sūtra And are therefore always present day and night. “ ‘

source: །དེ་བཞིན་དུ་ནི་རབ་དགའ་དང་། །ལྷ་མིན་རྒྱལ་པོ་གཞན་རྣམས་དང་། །ལྷ་ཡི་ཚོགས་ནི་གྲངས་མེད་པ། །སྟོབས་ཆེན་རབ་ཏུ་དཔའ་བ་རྣམས། །ཐམས་ཅད་འོངས་ནས་དེ་སྲུང་བྱེད།
en: Bali and Rāhu, Vemacitra and Saṃvara, Kharaskandha and Namuci, And similarly also Prahrāda, “ ‘And all the other asura kings, A countless assembly of devas With great might and supreme courage, Will all come and give their protection. “ ‘

source: །འཕྲོག་མ་འབྱུང་པོ་རྣམས་ཀྱི་མ། །གནོད་སྦྱིན་འཁོར་ནི་ལྔ་བརྒྱ་རྣམས། །མི་དེ་གཉིད་ལོག་སད་ཀྱང་རུང་། །རྟག་པར་འོངས་ནས་སྲུང་བར་བྱེད། །མ་རུངས་པ་དང་གདུག་པ་དང་། །གནོད་སྦྱིན་ལག་ན་དབྱུག་ཐོགས་དང་། །དུང་ཆེན་དང་ནི་སོ་བརྩེགས་མ། །སེམས་ཅན་ཀུན་གྱི་མདངས་འཕྲོག་པ། །དེ་འདྲའི་ལྷ་ཚོགས་མང་པོ་རྣམས།
en: Hārītī, the mother of spirits, With her retinue of five hundred yakṣas, Will always come and give their protection Whether the person is asleep or awake. “ ‘

source: །མཐུ་ཆེན་རྫུ་འཕྲུལ་ལྡན་པ་ཀུན། །མདོ་སྡེ་འཛིན་པ་རྟག་བསྲུངས་པས། །ཉིན་མཚན་རྟག་པར་ཡོང་མི་འབྲལ། །གཙོ་མོ་སྤོབས་པ་ཆེན་མོ་དང་། །ལྷ་ཡི་བུ་མོ་ཚད་མེད་དང་།
en: Caṇḍā and Caṇḍālikā, And also the yakṣiṇī Caṇḍikā, Kuntī and Kūṭadantī, And Sarva­sattva­ujahāriṇī— “ ‘The multitudes of those kinds of deities, All with great might and miraculous power, Always protect the holders of this sūtra And are never apart from them day and night. “ ‘

source: །དཔལ་གྱི་ལྷ་མོ་གཙོ་མོ་དང་། །དེ་ཡི་འཁོར་ནི་མང་པོ་དང་། །ས་ཆེན་འདི་ཡི་ལྷ་མོ་དང་། །ལོ་ཏོག་ཀུན་དགའ་ནགས་ཚལ་ལྷ། །ཤིང་གི་ལྷ་དང་ཆུ་རླུང་ལྷ། །མཆོད་རྟེན་ལྷ་ལ་སོགས་པ་དང་། །དེ་ལ་སོགས་པའི་ལྷ་མང་པོ། །དགའ་ཆེན་སེམས་ནི་རབ་བསྐྱེད་ནས།
en: The great lady Sarasvatī And innumerable goddesses; The lady, the goddess Śrī, And her numerous entourage; “ ‘The goddess of this great earth; The goddesses of harvests, parks, and forests; The goddesses of trees, rivers, and winds; And the goddesses of caityas, and so on— “ ‘These and all other goddesses, With great joy arising in their minds, Will all come and give their protection To those who are holders of this sūtra. “ ‘

source: །མདོ་སྡེ་འདི་ནི་འཛིན་པ་ལ། །ཐམས་ཅད་འོངས་ནས་སྲུང་བར་བྱེད། །མདོ་སྡེ་འཛིན་པ་མཐོང་གྱུར་ན། །ཚེ་དང་ཁ་དོག་སྟོབས་འཕེལ་བྱེད། །གཟི་བྱིན་དང་ནི་ཡོན་ཏན་དང་།
en: If they see holders of this sūtra, they will Increase their life, color, and strength And will adorn them, day and night, With magnificence and good qualities. “ ‘

source: །མཚན་མཆོག་གིས་ནི་བརྒྱན་པར་འགྱུར། །གཟའ་སྐར་ལྟས་ངན་སྟོན་པ་དང་། །དེ་ལ་ཉམ་ཐག་བྱུར་བྱུང་དང་། །རྨི་ལམ་ལྟས་ངན་མཐོང་བ་ཡང་། །ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད།
en: They will also bring to an end All bad signs from planets and lunar asterisms, The occurrence of ruin and disasters, And seeing bad omens in dreams. “ ‘

source: །ས་ཆེན་འདི་ཡི་ལྷ་མོ་ཡང་། །རབ་བརྟན་གཟི་བྱིན་མཐུ་སྟོབས་ལྡན། །མདོ་སྡེ་འདི་ཡི་མཐུ་ཡིས་ནི། །ཆོས་ཀྱི་རོ་ཡིས་རྟག་ཚིམ་པས།
en: Also, the goddess of this great earth, Who has enduring majesty and might, Will always be satisfied by the Dharma’s flavor Through the power of this sūtra. “ ‘

source: །ས་བཅུད་ཐུར་དུ་སོང་བ་ཡང་། །དཔག་ཚད་བརྒྱ་ནི་ཡན་ཆད་དུ། །ས་བཅུད་གྱེན་དུ་འཕགས་བྱས་ནས། །ས་ཆེན་འདི་ནི་སྣུམ་པར་བྱེད།
en: Even if the earth’s fertility has sunk As far as a hundred yojanas, She will cause the earth’s fertility to ascend And bring enrichment to this great earth. “ ‘

source: །ས་ཡི་རྔམས་སུ་དཔག་ཚད་ནི། །འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ནས། །རྡོ་རྗེའི་གཞི་ལ་ཐུག་པའི་བར། །ས་བཅུད་ཐམས་ཅད་གྱེན་དུ་འཕགས།
en: The fertility of the earth will rise From sixty-eight hundred thousand Yojanas deep in the earth, From as far as its vajra foundation. “ ‘

source: །མདོ་སྡེའི་རྒྱལ་པོ་འདི་ཐོས་དབང་། །བསོད་ནམས་ཕུང་པོ་ཆེ་ཐོབ་པས། །ལྷ་ཡི་འཁོར་ནི་མང་པོ་རྣམས། །ཐམས་ཅད་ཕན་ཡོན་ཐོབ་པར་འགྱུར།
en: Through the power of hearing this king of sūtras, A great accumulation of merit is obtained, And everyone in the vast assemblies Of the devas will obtain the benefit. “ ‘

source: །གཞན་ཡང་ལྷ་ཚོགས་མང་པོ་རྣམས། །མཐུ་སྟོབས་འོད་དང་ལྡན་འགྱུར་ཞིང་།
en: Moreover, the multitudes of devas Will be endowed with might and light.

source: །རབ་དགའ་རྟག་ཏུ་བདེ་བྱེད་པས། །ཉམས་པའི་མཚན་མ་སྤོང་བར་འགྱུར། །འཛམ་བུའི་གླིང་ནི་འདི་ནང་གི།
en: They will always be happy with perfect joy And will eliminate all signs of degeneration. “ ‘

source: །ནགས་ཚལ་འབྲས་བུ་ལོ་ཏོག་ལྷ། །མདོ་སྡེ་འདི་ཡི་བྱིན་བརླབས་ཀྱིས། །སེམས་ནི་རྟག་ཏུ་དགའ་ཐོབ་པ།
en: The goddesses of fruits, harvests, and forests That are within this Jambudvīpa Will constantly be joyful in mind Through the blessing of this sūtra. “ ‘

source: །ལོ་ཏོག་ཐམས་ཅད་ལེགས་འགྱུར་ཞིང་། །ཀུན་དུ་མེ་ཏོག་དམ་པ་དང་། །འབྲུ་རྣམས་ཐམས་ཅད་འཕེལ་འགྱུར་བས། །ས་ཆེན་ཀུན་དུ་རྒྱས་པར་འགྱུར།
en: All the harvests will be excellent, And everywhere sublime flowers And all grains will multiply So that this great earth will flourish. “ ‘

source: །འབྲས་བུའི་ལྗོན་ཤིང་མང་པོ་དང་། །ཐམས་ཅད་ལོ་ཏོག་མཆོག་སྐྱེས་ནས། །དྲི་ཞིམ་རྟག་པར་ཀུན་དུ་འཐུལ།
en: The multitudes of fruit trees And all the many parks and forests Will all have perfect flowers, And lovely aromas will be always pervading. “ ‘

source: །རྩྭ་མང་ལྗོན་ཤིང་རྣམས་ལས་ཀྱང་། །མེ་ཏོག་དམ་པ་སྐྱེ་འགྱུར་ཞིང་། །འབྲས་བུ་ཞིམ་པོ་སྐྱེ་འགྱུར་བས། །ཐམས་ཅད་ཀུན་དུ་གང་བར་འགྱུར། །འཛམ་བུའི་གླིང་ནི་འདི་དག་ཏུ། །ཀླུ་ཡི་བུ་མོ་ཚད་མེད་སྙེད། །རབ་ཏུ་དགའ་བའི་སེམས་བསྐྱེད་ནས།
en: The multitude of plants and the trees Will grow excellent flowers And grow delicious fruits; Everywhere will be filled with them. “ ‘

source: །ཐམས་ཅད་ཀུན་དུ་ཞུགས་ནས་ནི། །མེ་ཏོག་རྣམ་པ་དུ་མ་དང་། །དེ་བཞིན་པདྨ་དཀར་པོ་དང་། །པདྨ་སྔོན་པོ་དམར་པོ་གཉིས། །བསྐྱེད་ནས་རྫིང་ཀུན་གང་བར་འགྱུར།
en: Throughout this Jambudvīpa, All the innumerable nāga maidens Will experience minds filled with joy; They will enter everywhere, “ ‘And all the ponds will be filled with The growth of many kinds of flowers, And similarly with white lotuses And with both blue and red lotuses. “ ‘

source: །མདོ་སྡེ་འདི་ཡི་བྱིན་བརླབས་ཀྱིས། །ནམ་མཁའ་གཙང་ཞིང་སྒྲིབ་པ་མེད།
en: Through the blessing of this sūtra, The sky will be clear and unobscured.

source: །སྤྲིན་དང་ཁུག་རྣ་ཡོངས་སུ་སེལ། །མུན་ནག་ཐམས་ཅད་སྣང་བར་འགྱུར།
en: Clouds and mists will be completely dispelled, And all darkness will be illuminated. “ ‘

source: །ཉི་མའི་འོད་ཟེར་སྟོང་འགྱེད་པས། །དྲི་མེད་འོད་ནི་རྣམ་པར་དག །མདོ་སྡེའི་རྒྱལ་པོ་འདི་ཡི་མཐུས། །གླིང་བཞི་ཡོངས་བསྐོར་གསལ་བར་བྱེད།
en: A thousand rays of sunlight will radiate So that an unblemished pure light, Through the power of this king of sūtras, Will brighten the entire circle of the four continents. “ ‘

source: །མདོ་སྡེ་འདི་ཡི་བྱིན་བརླབས་ཀྱིས། །ལྷ་ཡི་བུ་རྣམས་བསྟངས་པས་ན། །ཐམས་ཅད་འཛམ་བུའི་གསེར་དག་གིས། །གཞལ་མེད་ཁང་ནི་བྱེད་པར་འགྱུར།
en: Through the blessing of this sūtra, All the devas will together Create a divine palace Made of Jambū River gold. “ ‘

source: །ཉི་ཟླ་དང་པོ་འཆར་བའི་ཚེ། །གླིང་འདི་མཐོང་ན་རབ་དགའ་བས། །རྟག་པར་སྣང་བ་ཆེན་པོ་ཡིས། །ཐམས་ཅད་ཀུན་དུ་གསལ་བར་བྱེད།
en: When the sun and moon first arise, When they see this continent, they will be overjoyed, And they will completely illuminate it With a constant great light. “ ‘

source: །ས་ཆེན་འདི་ལ་ཡོད་པ་ཡི། །པདྨའི་རྫིང་ནི་ཇི་སྙེད་པ། །ཉི་མས་དུས་བཞིན་གསལ་བྱེད་པས། །ཁ་ནི་མི་འབྱེད་གང་ཡང་མེད།
en: Of all of the lotus ponds There are on this great earth, There is none that will not blossom When they are brightened by the sun. “ ‘

source: །འཛམ་བུའི་གླིང་ནི་འདི་དག་ཏུ། །ལོ་ཏོག་འབྲས་བུ་སྨན་རྣམས་ཀུན། །ཐམས་ཅད་ལེགས་ཤིང་སྨིན་འགྱུར་བས། །ས་ཆེན་ཀུན་དུ་གང་བར་འགྱུར།
en: Within this Jambudvīpa, All harvests, fruits, and herbs Will ripen and be excellent And will fill the entire great earth. “ ‘

source: །མདོ་སྡེ་འདི་ཡི་བྱིན་བརླབས་ཀྱིས། །ཉི་ཟླ་སྣང་བར་བྱེད་པའི་གནས། །རྒྱུ་སྐར་ཚད་ལས་མི་འདའ་ཞིང་། །རླུང་ཆར་དུས་བཞིན་ལྡང་འབབ་པས།
en: Through the blessing of this sūtra, The lunar asterisms will not pass beyond The locations of the light of the moon and sun, And the winds will blow and the rains fall at the right times. “ ‘

source: །འཛམ་གླིང་འདི་དག་ཀུན་དུ་ཡང་། །ཡུལ་རྣམས་ལོ་ལེགས་སྐྱིད་པར་འགྱུར། །གང་ན་མདོ་སྡེ་འདི་བཞུགས་པ།
en: Throughout all of this Jambudvīpa, Excellent harvests will grow in the lands Wherever this sūtra is present.

source: །ཕྱོགས་གཞན་དག་ལས་ཁྱད་པར་འཕགས།
en: It will be superior to other places. “ ‘

source: །གསེར་འོད་དམ་པའི་མདོ་སྡེ་འདི། །གང་དུ་སྤེལ་ཞིང་འདོན་པ་དང་། །རྣམ་ཕྱེ་འཆད་པར་བྱེད་པའི་གནས། །བསོད་ནམས་གོང་མ་ཐོབ་པར་འགྱུར།
en: Whoever promulgates and recites This Sūtra of the Sublime Golden Light Will obtain superior merit, As will the places where it is taught.’ ”

source: །དེ་ནས་དཔལ་གྱི་ལྷ་མོ་ཆེན་མོ་དང་། ལྷ་ལ་སོགས་པ་མང་པོ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་ཐོས་ནས། །དེ་ཐམས་ཅད་རབ་དུ་དགའ་བས་མདོ་སྡེའི་རྒྱལ་པོ་འདི་དག་ཡོངས་སུ་འཛིན་པར་བྱེད་པ་དེ་དག་ལ། སེམས་རྩེ་གཅིག་ཏུ་ཡོངས་སུ་བསྲུངས་ནས་མྱ་ངན་གྱི་གནོད་པ་མེད་ཅིང་རྟག་ཏུ་བདེ་བ་ཐོབ་པར་འགྱུར་བས་མོས་པར་གྱུར་ཏོ།
en: Then the great goddess Śrī and the multitude of other devas, having heard the words spoken by the Bhagavat, were all overjoyed, and they all aspired to single-mindedly protect completely those who hold this king of sūtras so that they will not be afflicted by misery and will always gain happiness.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་ལྷ་དང་གནོད་སྦྱིན་རྣམས་ཀྱིས་ཡོངས་སུ་བསྲུང་ཞིང་འཛིན་པར་བྱེད་པའི་ལེའུ་སྟེ་ཉི་ཤུ་གཉིས་པའོ།། །།
en: This concludes “Protection and Care from Devas and Yakṣas,” the twenty-second chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པས་འཁོར་མང་པོའི་ནང་དུ་རྒྱ་ཆེར་ཡང་དག་པར་ཆོས་བཤད་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་དང་། དེའི་བུ་གཉིས་པོ་དངུལ་གྱི་ཏོག་དང་། དངུལ་གྱི་འོད་ཅེས་བྱ་བ་གཉིས་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་བཞེད་པར་གྱུར་པ་དང་།
en: Chapter 23: The Prophecy After the Tathāgata had taught the Dharma extensively in the midst of the great assembly, the bodhisattva Ruciraketu and his two sons, Rūpyaketu and Rūpyaprabha, requested the prophecy of their attainment of the highest, most complete enlightenment.

source: དེའི་ཚེ་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་མཆོག་ཏུ་རྒྱལ་བའི་འོད་ཅེས་བྱ་བ་གཙོ་བོར་གྱུར་པ་དང་ལྷན་ཅིག་ཏུ་སུམ་ཅུ་རྩ་གསུམ་ལྷའི་གནས་ནས་བབས་ཏེ།
en: At that time, ten thousand devas, chief among them Jvalanāntaratejorāja, descended together from the Trāyastriṃśa paradise.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་བཀས་བཤད་པའི་ཆོས་ཉན་པར་གྱུར་ཏོ།
en: They came before the Bhagavat, bowed their heads to his feet in homage, seated themselves to one side, and listened to the Dharma that was taught by the Bhagavat.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཁྱོད་མ་འོངས་པའི་དུས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བརྒྱ་སྟོང་ཚད་མེད་གྲངས་མེད་པ་སྙེད་འདས་པ་ན་གསེར་འོད་ཅེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་། ཞབས་སུ་ལྡན་པ།
en: The Bhagavat then said to the bodhisattva Ruciraketu, “You, in a future time after countless, innumerable hundreds of thousands of quintillions of eons have passed, will attain the highest, most complete enlightenment of perfect buddhahood in the world realm Suvarṇaprabhā. “

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པའི་སྐྱེས་བུ་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གསེར་དང་རིན་པོ་ཆེའི་རི་བོའི་རྒྱལ་པོ་ཞེས་བྱ་བར་གྱུར་ནས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: You will appear in the world as a tathāgata arhat samyaksaṃbuddha, one with wisdom and virtuous conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat, who has the name King of the Mountain of Gold and Jewels. “

source: །དེ་བཞིན་གཤེགས་པ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་བསྟན་པའི་ཆོས་རྣམས་ནུབ་པར་གྱུར་པ་དང་། དེའི་ཚེ་འདིའི་བུ་ཆེན་པོ་དངུལ་གྱི་ཏོག་ཅེས་བྱ་བ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པའི་རྒྱལ་ཚབ་ཏུ་གྱུར་ཏེ།
en: After that tathāgata has passed into nirvāṇa and the Dharma he taught has vanished, at that time this older son, Rūpyaketu, will become that tathāgata’s regent in that same world.

source: །དེའི་ཚེ་དེའི་མིང་བསྒྱུར་ནས་རྣམ་དག་ཏོག་ཅེས་བྱ་བར་འགྱུར་ཞིང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པའི་སྐྱེས་བུ་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གསེར་ཏོག་འོད་ཅེས་བྱ་བར་འགྱུར་རོ།
en: At that time, his name will be changed to Viśuddhaketu, and he will attain perfect buddhahood and become a tathāgata arhat samyaksaṃbuddha, one with wisdom and virtuous conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat, who has the name Light of Golden Ornaments. “

source: །དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་བསྟན་པའི་ཆོས་རྣམས་ནུབ་པར་གྱུར་པ་དང་། འདིའི་བུ་ཆུང་ངུ་དངུལ་གྱི་འོད་དེ་བཞིན་གཤེགས་པ་དེའི་རྒྱལ་ཚབ་ཏུ་འགྱུར་བས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ།
en: At that time, when that tathāgata has passed into nirvāṇa and the Dharma he taught has vanished, this younger son, Rūpyaprabha, will become that tathāgata’s regent, and in that world he will attain perfect buddhahood and become a tathāgata arhat samyaksaṃbuddha, one with wisdom and virtuous conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat, who has the name Suvarṇaprabha.”

source: བླ་ན་མེད་པའི་སྐྱེས་བུ་ཁ་ལོ་སྒྱུར་བ།
en: That was the prophecy.

source: ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གསེར་འོད་ཅེས་བྱ་བར་འགྱུར་རོ། །ཞེས་ལུང་བསྟན་ཏོ། །དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་གིས་སྐྱེས་བུ་ཆེན་པོ་གསུམ་པོ་དེ་དག་གིས་ལུང་བསྟན་པ་ཡང་ཐོས།
en: Those ten thousand devas also heard the prophecy for those three great beings then.

source: འདི་ལྟར་མདོ་སྡེའི་རྒྱལ་པོ་མཆོག་དམ་པ་འདི་ཡང་ཐོས་པས་སེམས་རབ་ཏུ་དགའ་བ་སྐྱེས་ནས་རྣམ་པར་དག་ཅིང་དྲི་མ་མེད་པར་གྱུར་པས་དཔེར་ན་ནམ་མཁའ་ལྟ་བུར་གྱུར་ཏོ།
en: When they heard in this way this sublime, supreme king of sūtras, their minds became overjoyed, and pure and stainless, like space.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པས་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་ཐུགས་ཀྱིས་མཁྱེན་པས་བྱང་ཆུབ་ཆེན་པོར་ལུང་བསྟན་ནས། འདི་སྐད་དུ་ལྷའི་བུ་ཁྱེད་ཅག་མ་འོངས་པའི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བརྒྱ་སྟོང་ཚད་མེད་གྲངས་མེད་པ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་དབང་པོའི་ཏོག་མངོན་པར་འཕགས་པ་ཞེས་བྱ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། རུས་རིགས་ཀྱང་མཐུན།
en: Then the Bhagavat, knowing in his mind the ripening of the good roots of those ten thousand devas, prophesied their great enlightenment, saying, “Devas, after many countless, innumerable hundreds of thousands of quintillions of future eons have passed, you will attain the highest, most complete enlightenment of perfect buddhahood in a world realm by the name of Śālendra­dhvajāgravatī.

source: མིང་ཡང་མཐུན་པར་འགྱུར་བས་ཐམས་ཅད་ཞལ་དང་སྤྱན་རྣམ་པར་དག་ཅིང་།
en: You will be in the same family, in the same clan, and have the same name.

source: ཨུཏྤ་ལའི་དྲིའི་རི་མོ་ཞེས་བྱ་བ་མཚན་རྣམ་པ་བཅུ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་ཏེ།
en: You will all have a perfect name with ten components: Prasanna­vadanotpala­gandha­kūṭa.

source: འདི་ལྟར་རིམ་བཞིན་དུ་སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ།
en: In this way, you will successively appear in the world as ten thousand buddhas.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་ཀྱི་ཤིང་གི་ལྷ་མོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་འདི་དག་ནི་སུམ་ཅུ་རྩ་གསུམ་ལྷའི་གནས་ནས་ཆོས་མཉན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མཆིས་པ་ལགས་ན།
en: Then the goddess of the Bodhi tree said to the Bhagavat, “Bhagavat, these ten thousand devas came from the Trāyastriṃśa paradise to listen to the Dharma and came before the Bhagavat.

source: ཅིའི་སླད་དུ་དེ་བཞིན་གཤེགས་པས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པར་མཛད་ལགས། བདག་གིས་ནི་ལྷའི་བུ་འདི་དག་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཕུན་སུམ་ཚོགས་པར་བསྒོམས་ནས་དཀའ་བ་སྤྱད་དེ། ལག་པ་དང་། རྐང་པ་དང་། མགོ་དང་། མིག་དང་། རྐང་དང་། ཀླད་རྒྱས་དང་། གཡོག་འཁོར་དང་། བུ་དང་། འཆིས་འབྲང་དང་། གླང་པོ་ཆེ་དང་། རྟ་དང་། ཤིང་རྟ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། མངག་གཞུག་བགྱིད་པ་དང་། ཁང་ཁྱིམ་དང་། ཀུན་དགའ་ར་བ་དང་། ནགས་ཚལ་དང་། གསེར་དང་། དངུལ་དང་། བཻ་ཌཱུརྱ་དང་། སྤུག་དང་། རྡོའི་སྙིང་པོ་དང་། བྱི་རུ་དང་། མན་ཤེལ་དང་། དུང་དང་།
en: For what reason has the Tathāgata given them the prophecy of their attainment of the highest, most complete enlightenment of perfect buddhahood?

source: བཟའ་བ་དང་། བཏུང་བ་དང་། གོས་དང་། མལ་ཆ་དང་། གསོས་སྨན་དག་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བར་ཡང་མ་ཐོས་ཏེ།
en: I have not heard that these devas have meditated excellently on the six perfections and undergone hardships, or have given away their hands, feet, heads, eyes, legs, brains, servants, children, wives, elephants, oxen, horses, carriages, male slaves, female slaves, messengers, homes, parks, forests, gold, silver, beryls, white corals, emeralds, red corals, crystals, conches, food, drink, clothes, beds, or medicine for illness.

source: བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་ཚད་མ་མཆིས་པ་གཞན་དག་ནི་མཆོད་པའི་ཡོ་བྱད་མང་པོས་འདས་པའི་སངས་རྒྱས་འབུམ་ཕྲག་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མ་མཆིས་པ་སྙེད་ལ་མཆོད་པ་བགྱིས་ནས། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སོ་སོ་ནས་བསྐལ་པ་ཚད་མ་མཆིས་ཤིང་མཐའ་མ་མཆིས་པ་སྙེད་ལོན་ནས་གདོད་དེའི་རྗེས་ལ་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་འཐོབ་པར་འགྱུར་བ་ལགས་ན།
en: Countless hundreds of thousands of other bodhisattvas have offered many offerings of requisites to countless hundreds of thousands of quintillions of past buddhas, and in this way each of those bodhisattvas has obtained the prophecy of their enlightenment only after innumerable endless eons have passed. “

source: བཅོམ་ལྡན་འདས་ལྷའི་བུ་འདི་དག་རྒྱུ་རྐྱེན་ནི་གང་། སྤྱོད་པ་མཆོག་ནི་ཇི་ལྟ་བུ་ཞིག་མངོན་པར་བསྒྲུབས། དགེ་བའི་རྩ་བ་ནི་ཇི་ལྟ་བུ་ཞིག་བསྐྲུན་ན་ལྷའི་གནས་དེ་ནས་འདིར་མཆིས་ཏེ། ཡུད་ཙམ་ཞིག་ཆོས་ཐོས་པ་འདི་ཉིད་ཀྱིས་ལུང་བསྟན་པ་ཐོབ་པར་གྱུར་ལགས།
en: Bhagavat, through what causes and conditions, through what supreme conduct, and through planting what good roots have these deities come from their paradise and through hearing the Dharma for a short time obtained their prophecies?

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་བཀས་བཤད་དེ་ཐེ་ཙོམ་གྱི་དྲ་བ་གཅད་དུ་གསོལ།
en: I request the Bhagavat to explain this to me and cut through the net of my doubts.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཤིང་གི་ལྷ་མོ་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་ལྷ་མོ་ཁྱོད་ཀྱིས་ཇི་སྐད་སྨྲས་པ་བཞིན་ཏེ།
en: The Bhagavat said to the goddess of the Bodhi tree, “Noble goddess, it is as you have said.

source: འདི་དག་ཐམས་ཅད་ནི་དགེ་བའི་རྩ་བ་མཆོག་དམ་པའི་རྒྱུ་དང་རྐྱེན་དང་ནན་ཏན་བརྩོན་འགྲུས་ཀྱིས་དཀའ་བ་བསྒྲུབས་ནས་གདོད་ལུང་བསྟན་པ་ཐོབ་པ་ཡིན་པས་ལྷའི་བུ་མང་པོ་འདི་དག་ལྷའི་གཞལ་མེད་ཁང་མཆོག་དམ་པ་ནས་འདོད་པ་ལྔའི་བདེ་བ་སྤངས་ཏེ། ཆེད་དུ་གསེར་འོད་དམ་པའི་མདོ་སྡེ་འདི་མཉན་དུ་འོངས་པ་ཡིན་པས་ཆོས་ཐོས་པར་གྱུར་ནས་ཀྱང་མདོ་སྡེ་འདི་ལ་སེམས་ཀྱིས་གུས་པ་བསྐྱེད་དེ།
en: All of these have obtained the prophecy after accomplishing the causes and conditions of excellent good roots and undergoing hardships with dedication and diligence. This multitude of devas has forsaken the five sensory pleasures in their perfect, sublime divine palaces and has come to listen to this Sūtra of the Sublime Golden Light, so that when they heard the Dharma their minds developed reverence for this sūtra.

source: བཻ་ཌཱུརྱ་ཡོངས་སུ་དག་པ་ལྟར་སྐྱོན་གྱི་དྲི་མ་མེད་པར་གྱུར་པ་དང་།
en: They became unstained by faults, like completely pure beryls.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གསུམ་པོ་འདི་ལུང་བསྟན་པའི་དངོས་པོ་ཡང་ཐོས་པ་དང་།
en: Moreover, they heard that which was the prophecy for these three bodhisattvas mahāsattvas.

source: གཞན་ཡང་འདས་པའི་དུས་ཀྱི་ཚེ་ཡུན་རིང་པོར་ཡང་དག་པའི་སྤྱོད་པ་བསྒྲུབས་ནས་ཡི་དམ་ཆེན་པོ་བླངས་པའི་རྒྱུ་དང་རྐྱེན་དེའི་ཕྱིར། ངས་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པ་ཡིན་ནོ།
en: Moreover, in the past, they have for a long time accomplished true conduct, and they made a great commitment, and because of those causes and conditions I have prophesied their attainment of the highest, most complete enlightenment of buddhahood in a future time.”

source: །དེ་དག་ཤིང་གི་ལྷ་མོ་དེས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་ཐོས་ནས། རབ་ཏུ་དགའ་བས་མངོན་པར་ཡིད་ཆེས་པར་གྱུར་ཏོ།
en: The goddess of the Bodhi tree, having heard the Bhagavat’s words, became overjoyed and had conviction in them.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་ལུང་བསྟན་པའི་ལེའུ་སྟེ་ཉི་ཤུ་གསུམ་པའོ།། །།
en: This concludes “The Prophecy,” the twenty-third chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་ཀྱི་ཤིང་གི་ལྷ་མོ་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་ལྷ་མོ་ལེགས་པར་ཉོན་ལ་ཤིན་ཏུ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: Chapter 24: Completely Curing Illness The Bhagavat said to the goddess of the Bodhi tree, “Noble goddess, listen well and retain this perfectly in your mind.

source: ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་འདི་དག་གི་སྔོན་གྱི་སྨོན་ལམ་གྱི་རྒྱུ་དང་རྐྱེན་གང་ཡིན་པ་དེང་ཁྱོད་ལ་བཤད་པར་བྱའོ། །རིགས་ཀྱི་ལྷ་མོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ཀྱི་བསྐལ་པ་གྲངས་མེད་པ།
en: Today I will teach you the past prayers of these ten thousand devas that were causes and conditions. “

source: ཚད་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པའི་སྐྱེས་བུ་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: Noble goddess, in the past, in a time gone by, an uncountable, innumerable, inconceivable number of eons ago, at that time the Tathāgata Arhat Samyaksaṃbuddha, the one with wisdom and virtuous conduct, the Sugata, the one who knows the world’s beings, the unsurpassable guide who tames beings, the teacher of devas and humans, the Buddha, the Bhagavat by the name of Ratnaśikhin appeared in the world. “

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རིན་ཆེན་གཙུག་ཕུད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ཡང་དག་པའི་ཆོས་ནུབ་པར་གྱུར་ནས་གཟུགས་བརྙན་གྱི་ཆོས་ཀྱི་ཚེ་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་གི་འོད་ཅེས་བྱ་བ་ཞིག་ཡོད་དེ། རྟག་པར་ཡང་དག་པའི་ཆོས་ཀྱིས་ཕ་མ་བཞིན་དུ་མི་རྣམས་ལ་རྗེས་སུ་སྟོན་པར་བྱེད་དོ།
en: Noble goddess, at that time, after that bhagavat had passed into nirvāṇa, when the true Dharma had vanished and there was merely the outer appearance of the Dharma, there was a king by the name of Sureśvaraprabha who constantly governed the people in accord with the true Dharma, as if he were their father and mother. “

source: །རྒྱལ་པོ་དེའི་ཡུལ་ན་ཚོང་དཔོན་ཆུ་འཛིན་ཅེས་བྱ་བ་སྨན་གྱི་རིག་པ་ལ་ཤིན་ཏུ་མཁས་པ། ཤེས་པའི་ཡན་ལག་བརྒྱད་ལེགས་པར་ཁོང་དུ་ཆུད་པ།
en: At that time, in the king’s land there was a head merchant by the name of Jaladhara, who was greatly learned in medicine and perfectly knew all eight branches of the Āyurveda.

source: སེམས་ཅན་གྱི་ནད་ཀྱི་སྡུག་བསྔལ་འབྱུང་བ་ཆེན་པོ་བཞི་མི་མཐུན་པ་ལས་གྱུར་པ་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་ཅིང་གསོ་བར་བྱེད་པ་ཞིག་ཡོད་དེ།
en: He healed beings, saving them from all the sufferings that arise from disharmony among the four great elements. “

source: རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་ཚོང་དཔོན་ཆུ་འཛིན་དེ་ལ་བུ་ཆུ་འབེབས་ཞེས་བྱ་བ་བྱད་བཞིན་སྡུག་ཅིང་མཛེས་པ། མང་པོ་ཀུན་གྱིས་བལྟ་བར་མོས་པ། །རང་བཞིན་གྱིས་སེམས་མྱུར་བ།
en: Noble goddess, at that time the head merchant Jaladhara had a son named Jalavāhana, who was attractive and handsome and who an entire multitude longed to look at.

source: གཙུག་ལག་རྣམས་ལེགས་པར་རྟོགས་པ། ཡི་གེ་དང་། རི་མོ་དང་། རྩིས་དང་། གྲངས་རྣམས་མངོན་པར་མི་རྟོགས་པ་གང་ཡང་མེད་པ་ཞིག་ཡོད་པར་གྱུར་ཏོ།
en: He had a naturally swift mind and understood the treatises, and there was nothing he did not know about letters, drawing, calculations, and numbers. “
